{
  "rule_id": "threshold-windows-invalid-user-brute-force",
  "type": "threshold",
  "language": "kuery",
  "name": "Windows Brute-force targeting Non-Existent Users",
  "description": "Phát hiện hành vi dò quét, đăng nhập liên tục vào các tài khoản không tồn tại trên hệ thống (SubStatus: 0xc0000064) dựa trên IP nguồn.",
  "query": "event.category: \"authentication\" and event.outcome: \"failure\" and winlog.event_data.SubStatus: \"0xc0000064\"",
  "threshold": {
    "field": ["source.ip"],
    "value": 15
  },
  "index": ["winlogbeat-*", "logs-endpoint.events.*"],
  "severity": "high",
  "risk_score": 75
}